Revit 2026 API

# FamilyManager Properties

---

The FamilyManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurrentType | The current family type. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | ParameterBuiltInParameter | Obtains the parameter of this type with a given parameter id. |
|  | ParameterDefinition | Obtains the parameter of this type with a given definition. |
|  | ParameterGuid | Obtains the parameter of this type with a given GUID for a shared parameter. |
|  | ParameterString | Obtains the parameter of this type with a given name. |
|  | Parameters | All family parameters in this family. |
|  | Types | All family types in the family. |

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace